src/Catalogs/цур_ИнформационныеБазы/цур_ИнформационныеБазы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>цур_ИнформационныеБазы</name>
  <predefined>
    <items>
      <name>ПоУмолчанию</name>
      <description>По умолчанию</description>
    </items>
  </predefined>
  <attributes>
    <name>СервернаяБаза</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресБазы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Пароль</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АдресСервиса</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТекущаяВерсия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>5</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьДляСборки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КаталогВыгрузкиКонфигурации</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсточникМетаданных</name>
    <type>
      <types>EnumRef.цур_ИсточникиМетаданных</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсточникРолей</name>
    <type>
      <types>EnumRef.цур_РежимыЗагрузкиРолей</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗагружатьМетаданныеИз</name>
    <type>
      <types>EnumRef.цур_ИсточникиМетаданных</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗагружатьРолиИз</name>
    <type>
      <types>EnumRef.цур_РежимыЗагрузкиРолей</types>
    </type>
  </attributes>
  <attributes>
    <name>ПутьКПлатформе</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьПромежуточнуюБазу</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/Enums/цур_ИсточникиМетаданных/цур_ИсточникиМетаданных.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>цур_ИсточникиМетаданных</name>
  <enumValues>
    <name>ТекущаяКонфигурация</name>
  </enumValues>
  <enumValues>
    <name>ИзКаталогаФайлов</name>
  </enumValues>
  <enumValues>
    <name>ВыгрузитьАвтоматически</name>
  </enumValues>
  <enumValues>
    <name>ИзРегистра</name>
  </enumValues>
  <enumValues>
    <name>ИзРепозитория</name>
  </enumValues>
</mdclass:Enum>

src/Enums/цур_РежимыЗагрузкиРолей/цур_РежимыЗагрузкиРолей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>цур_РежимыЗагрузкиРолей</name>
  <enumValues>
    <name>ИзКаталогаВыгрузки</name>
  </enumValues>
  <enumValues>
    <name>ВыгрузитьАвтоматически</name>
  </enumValues>
  <enumValues>
    <name>ИзРегистра</name>
  </enumValues>
  <enumValues>
    <name>ИзРепозитория</name>
  </enumValues>
</mdclass:Enum>

src/Catalogs/цур_ИнформационныеБазы/Forms/ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;

	ОбновитьВидимостьЭлементовНаСервере();

КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)

	НужноКаталог = (Объект.ИсточникМетаданных = Перечисления.цур_ИсточникиМетаданных.ИзКаталогаФайлов)
		ИЛИ (Объект.ИсточникРолей = Перечисления.цур_РежимыЗагрузкиРолей.ИзКаталогаВыгрузки)
		ИЛИ (Объект.ЗагружатьМетаданныеИз = Перечисления.цур_ИсточникиМетаданных.ИзКаталогаФайлов)
		ИЛИ (Объект.ЗагружатьРолиИз = Перечисления.цур_РежимыЗагрузкиРолей.ИзКаталогаВыгрузки);

	НужнаПлатформа = (Объект.ИсточникМетаданных = Перечисления.цур_ИсточникиМетаданных.ВыгрузитьАвтоматически)
		ИЛИ (Объект.ИсточникРолей = Перечисления.цур_РежимыЗагрузкиРолей.ВыгрузитьАвтоматически)
		ИЛИ (Объект.ЗагружатьМетаданныеИз = Перечисления.цур_ИсточникиМетаданных.ВыгрузитьАвтоматически)
		ИЛИ (Объект.ЗагружатьРолиИз = Перечисления.цур_РежимыЗагрузкиРолей.ВыгрузитьАвтоматически)
		ИЛИ Объект.ИспользоватьПромежуточнуюБазу;

	Если НужноКаталог И НЕ ЗначениеЗаполнено(Объект.КаталогВыгрузкиКонфигурации) Тогда
		цур_ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			НСтр("ru = 'Укажите каталог выгрузки конфигурации для выбранных источников.'"),
			,
			"КаталогВыгрузкиКонфигурации",
			"Объект",
			Отказ);
	КонецЕсли;

	Если НужнаПлатформа И НЕ ЗначениеЗаполнено(Объект.ПутьКПлатформе) Тогда
		цур_ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			НСтр("ru = 'Укажите путь к платформе 1С для выбранных источников.'"),
			,
			"ПутьКПлатформе",
			"Объект",
			Отказ);
	КонецЕсли;

	Если Объект.ИсточникМетаданных = Перечисления.цур_ИсточникиМетаданных.ИзРепозитория Тогда
		цур_ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			НСтр("ru = 'Источник метаданных ""Из репозитория"" пока не реализован. Выберите другой источник.'"),
			,
			"ИсточникМетаданных",
			"Объект",
			Отказ);
	КонецЕсли;

	Если Объект.ИсточникРолей = Перечисления.цур_РежимыЗагрузкиРолей.ИзРепозитория Тогда
		цур_ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			НСтр("ru = 'Источник ролей ""Из репозитория"" пока не реализован. Выберите другой источник.'"),
			,
			"ИсточникРолей",
			"Объект",
			Отказ);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ИсточникМетаданныхПриИзменении(Элемент)
	ОбновитьВидимостьЭлементов();
КонецПроцедуры

&НаКлиенте
Процедура ИсточникРолейПриИзменении(Элемент)
	ОбновитьВидимостьЭлементов();
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьПромежуточнуюБазуПриИзменении(Элемент)
	ОбновитьВидимостьЭлементов();
КонецПроцедуры

&НаКлиенте
Процедура ЗагружатьМетаданныеИзПриИзменении(Элемент)
	ОбновитьВидимостьЭлементов();
КонецПроцедуры

&НаКлиенте
Процедура ЗагружатьРолиИзПриИзменении(Элемент)
	ОбновитьВидимостьЭлементов();
КонецПроцедуры

&НаКлиенте
Процедура КаталогВыгрузкиКонфигурацииНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ОткрытьДиалогВыбораКаталога();
КонецПроцедуры

&НаКлиенте
Процедура КаталогВыгрузкиКонфигурацииЗагрузкиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ОткрытьДиалогВыбораКаталога();
КонецПроцедуры

&НаКлиенте
Процедура КаталогВыгрузкиВыборЗавершение(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт

	Если ВыбранныеФайлы = Неопределено Или ВыбранныеФайлы.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;

	Объект.КаталогВыгрузкиКонфигурации = ВыбранныеФайлы[0];
	Модифицированность = Истина;

КонецПроцедуры

&НаКлиенте
Процедура ПутьКПлатформеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ОткрытьДиалогВыбораПлатформы();
КонецПроцедуры

&НаКлиенте
Процедура ПутьКПлатформеЗагрузкиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ОткрытьДиалогВыбораПлатформы();
КонецПроцедуры

&НаКлиенте
Процедура ПутьКПлатформеВыборЗавершение(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт

	Если ВыбранныеФайлы = Неопределено Или ВыбранныеФайлы.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;

	Объект.ПутьКПлатформе = ВыбранныеФайлы[0];
	Модифицированность = Истина;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКоманд

&НаКлиенте
Процедура ОбновитьМетаданные(Команда)

	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'Сначала запишите информационную базу.'"));
		Возврат;
	КонецЕсли;

	ЗапуститьФоновоеОбновление("Метаданные");

КонецПроцедуры

&НаКлиенте
Процедура ОбновитьРоли(Команда)

	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'Сначала запишите информационную базу.'"));
		Возврат;
	КонецЕсли;

	ЗапуститьФоновоеОбновление("Роли");

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОбновитьВидимостьЭлементов()

	ИзКаталогаФайлов   = ПредопределенноеЗначение("Перечисление.цур_ИсточникиМетаданных.ИзКаталогаФайлов");
	ИзКаталогаВыгрузки = ПредопределенноеЗначение("Перечисление.цур_РежимыЗагрузкиРолей.ИзКаталогаВыгрузки");
	ВыгрузитьАвтомат   = ПредопределенноеЗначение("Перечисление.цур_ИсточникиМетаданных.ВыгрузитьАвтоматически");
	ВыгрузитьАвтоРоли  = ПредопределенноеЗначение("Перечисление.цур_РежимыЗагрузкиРолей.ВыгрузитьАвтоматически");

	// Runtime-источники (вкладка "Источники конфигурации")
	НужноКаталогИсточник = (Объект.ИсточникМетаданных = ИзКаталогаФайлов)
		ИЛИ (Объект.ИсточникРолей = ИзКаталогаВыгрузки);

	// Load-режимы (вкладка "Загрузка в регистры")
	НужноКаталогЗагрузки = (Объект.ЗагружатьМетаданныеИз = ИзКаталогаФайлов)
		ИЛИ (Объект.ЗагружатьРолиИз = ИзКаталогаВыгрузки);

	// Runtime - путь к платформе (вкладка "Платформа и БСП")
	НужнаПлатформаИсточник = (Объект.ИсточникМетаданных = ВыгрузитьАвтомат)
		ИЛИ (Объект.ИсточникРолей = ВыгрузитьАвтоРоли)
		ИЛИ Объект.ИспользоватьПромежуточнуюБазу;

	// Load - путь к платформе (вкладка "Загрузка в регистры")
	НужнаПлатформаЗагрузки = (Объект.ЗагружатьМетаданныеИз = ВыгрузитьАвтомат)
		ИЛИ (Объект.ЗагружатьРолиИз = ВыгрузитьАвтоРоли);

	Элементы.ГруппаКаталога.Видимость         = НужноКаталогИсточник;
	Элементы.ГруппаПлатформа.Видимость        = НужнаПлатформаИсточник;
	Элементы.ГруппаКаталогаЗагрузки.Видимость  = НужноКаталогЗагрузки;
	Элементы.ГруппаПлатформыЗагрузки.Видимость = НужнаПлатформаЗагрузки;

КонецПроцедуры

&НаСервере
Процедура ОбновитьВидимостьЭлементовНаСервере()

	//BSLLS:Typo-off
	ИзКаталогаФайлов   = Перечисления.цур_ИсточникиМетаданных.ИзКаталогаФайлов;
	ИзКаталогаВыгрузки = Перечисления.цур_РежимыЗагрузкиРолей.ИзКаталогаВыгрузки;
	ВыгрузитьАвтомат   = Перечисления.цур_ИсточникиМетаданных.ВыгрузитьАвтоматически;
	ВыгрузитьАвтоРоли  = Перечисления.цур_РежимыЗагрузкиРолей.ВыгрузитьАвтоматически;
	//BSLLS:Typo-on

	// Runtime-источники (вкладка "Источники конфигурации")
	НужноКаталогИсточник = (Объект.ИсточникМетаданных = ИзКаталогаФайлов)
		ИЛИ (Объект.ИсточникРолей = ИзКаталогаВыгрузки);

	// Load-режимы (вкладка "Загрузка в регистры")
	НужноКаталогЗагрузки = (Объект.ЗагружатьМетаданныеИз = ИзКаталогаФайлов)
		ИЛИ (Объект.ЗагружатьРолиИз = ИзКаталогаВыгрузки);

	// Runtime - путь к платформе (вкладка "Платформа и БСП")
	НужнаПлатформаИсточник = (Объект.ИсточникМетаданных = ВыгрузитьАвтомат)
		ИЛИ (Объект.ИсточникРолей = ВыгрузитьАвтоРоли)
		ИЛИ Объект.ИспользоватьПромежуточнуюБазу;

	// Load - путь к платформе (вкладка "Загрузка в регистры")
	НужнаПлатформаЗагрузки = (Объект.ЗагружатьМетаданныеИз = ВыгрузитьАвтомат)
		ИЛИ (Объект.ЗагружатьРолиИз = ВыгрузитьАвтоРоли);

	Элементы.ГруппаКаталога.Видимость         = НужноКаталогИсточник;
	Элементы.ГруппаКаталогаЗагрузки.Видимость  = НужноКаталогЗагрузки;
	Элементы.ГруппаПлатформыЗагрузки.Видимость = НужнаПлатформаЗагрузки;

КонецПроцедуры

&НаКлиенте
Процедура ОткрытьДиалогВыбораКаталога()

	ОповещениеОЗавершении = Новый ОписаниеОповещения("КаталогВыгрузкиВыборЗавершение", ЭтотОбъект);

	ДиалогВыбора = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
	ДиалогВыбора.Заголовок = НСтр("ru = 'Выберите каталог с выгруженной конфигурацией'");
	ДиалогВыбора.Каталог = Объект.КаталогВыгрузкиКонфигурации;
	ДиалогВыбора.Показать(ОповещениеОЗавершении);

КонецПроцедуры

&НаКлиенте
Процедура ОткрытьДиалогВыбораПлатформы()

	ОповещениеОЗавершении = Новый ОписаниеОповещения("ПутьКПлатформеВыборЗавершение", ЭтотОбъект);

	ДиалогВыбора = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ДиалогВыбора.Заголовок = НСтр("ru = 'Укажите путь к 1cv8.exe'");
	ДиалогВыбора.Фильтр = "1cv8.exe|1cv8.exe";
	ДиалогВыбора.ПолноеИмяФайла = Объект.ПутьКПлатформе;
	ДиалогВыбора.Показать(ОповещениеОЗавершении);

КонецПроцедуры

&НаКлиенте
Процедура ЗапуститьФоновоеОбновление(Тип)

	ЗапускДанные = ЗапуститьФоновоеЗаданиеНаСервере(Тип);

	ФоновоеЗаданиеИдентификатор   = ЗапускДанные.ИдентификаторЗадания;
	ФоновоеЗаданиеАдресРезультата = ЗапускДанные.АдресРезультата;
	ФоновоеЗаданиеТип             = Тип;

	УстановитьБлокировкуКнопок(Истина);

	ПоказатьОповещениеПользователя(
		?(Тип = "Метаданные", НСтр("ru = 'Метаданные'"), НСтр("ru = 'Роли'")), ,
		НСтр("ru = 'Обновление запущено в фоне...'"));

	ПодключитьОбработчикОжидания("ПроверитьСостояниеФоновогоЗадания", 2, Истина);

КонецПроцедуры

&НаСервере
Функция ЗапуститьФоновоеЗаданиеНаСервере(Знач Тип)

	ПараметрыЗадания = Новый Структура("ИнформационнаяБаза", Объект.Ссылка);

	Если Тип = "Метаданные" Тогда
		ИмяПроцедуры = "цур_ПровайдерМетаданныхСервер.ЗагрузитьМетаданныеИБФоновоеЗадание";
		Наименование = НСтр("ru = 'Обновление метаданных'");
	Иначе
		ИмяПроцедуры = "цур_ПровайдерРолейСервер.ЗагрузитьРолиВРегистрФоновоеЗадание";
		Наименование = НСтр("ru = 'Обновление ролей'");
	КонецЕсли;

	Возврат цур_ФоновыеЗаданияСервер.ВыполнитьВФоне(
		ИмяПроцедуры, ПараметрыЗадания, УникальныйИдентификатор, Наименование);

КонецФункции

&НаКлиенте
Процедура ПроверитьСостояниеФоновогоЗадания()

	Состояние = ПолучитьСостояниеНаСервере(ФоновоеЗаданиеИдентификатор);

	Если Состояние = "Выполняется" Тогда
		ПодключитьОбработчикОжидания("ПроверитьСостояниеФоновогоЗадания", 2, Истина);
		Возврат;
	КонецЕсли;

	УстановитьБлокировкуКнопок(Ложь);

	ЗаголовокОповещения = ?(ФоновоеЗаданиеТип = "Метаданные",
		НСтр("ru = 'Метаданные'"),
		НСтр("ru = 'Роли'"));

	Если Состояние = "Завершено" Тогда
		Результат = ПолучитьРезультатНаСервере(ФоновоеЗаданиеАдресРезультата);
		ОбработатьРезультатЗагрузки(Результат, ЗаголовокОповещения);
	Иначе
		ТекстОшибки = ПолучитьОшибкуНаСервере(ФоновоеЗаданиеИдентификатор);
		ПоказатьОповещениеПользователя(ЗаголовокОповещения, , НСтр("ru = 'Ошибка фонового задания'"));
		Если НЕ ПустаяСтрока(ТекстОшибки) Тогда
			цур_ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
		КонецЕсли;
	КонецЕсли;

	ФоновоеЗаданиеИдентификатор   = Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000");
	ФоновоеЗаданиеАдресРезультата = "";
	ФоновоеЗаданиеТип             = "";

КонецПроцедуры

&НаКлиенте
Процедура ОбработатьРезультатЗагрузки(Результат, Заголовок)

	Если Результат = Неопределено Тогда
		ПоказатьОповещениеПользователя(Заголовок, , НСтр("ru = 'Результат не получен'"));
		Возврат;
	КонецЕсли;

	Если Результат.Успешно Тогда
		ПоказатьОповещениеПользователя(Заголовок, ,
			СтрШаблон(НСтр("ru = 'Загружено: %1'"), Результат.Количество));
	Иначе
		ПоказатьОповещениеПользователя(Заголовок, , НСтр("ru = 'Ошибка загрузки'"));
		Для Каждого Ошибка Из Результат.Ошибки Цикл
			цур_ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Ошибка);
		КонецЦикла;
	КонецЕсли;

КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьСостояниеНаСервере(Знач ИдентификаторЗадания)
	Возврат цур_ФоновыеЗаданияСервер.ПолучитьСостояние(ИдентификаторЗадания);
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьРезультатНаСервере(Знач АдресРезультата)
	Результат = ПолучитьИзВременногоХранилища(АдресРезультата);
	УдалитьИзВременногоХранилища(АдресРезультата);
	Возврат Результат;
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьОшибкуНаСервере(Знач ИдентификаторЗадания)
	Возврат цур_ФоновыеЗаданияСервер.ПолучитьОписаниеОшибки(ИдентификаторЗадания);
КонецФункции

&НаКлиенте
Процедура УстановитьБлокировкуКнопок(Заблокировать)
	Элементы.ОбновитьМетаданные.Доступность = НЕ Заблокировать;
	Элементы.ОбновитьРоли.Доступность       = НЕ Заблокировать;
КонецПроцедуры

#КонецОбласти
